<a href="https://colab.research.google.com/github/lnandi1/Cod21/blob/main/Pandas_1st_Steps.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Program 1
# Creating a DataFrame
import pandas as pd
df = pd.DataFrame([10,20,30,40], 
                  columns = ['numbers'],
                  index = ['a','b','c','d'])
df

   numbers
a       10
b       20
c       30
d       40

In [ ]:
# Program 2
# Listing the Indexes in the DataFrame
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [ ]:
# Program 3
# Listing the Column Names in the DataFrame
df.columns

Index(['numbers'], dtype='object')

**Exercise 1 - Write a Program which:-**
 constructs a DataFrame where the indexes are:- j,k,l,m,n and the Numbers are:- 

1.   Constructs a DataFrame where indexes are:- j,k,l,m,n
2.   Numbers are:- 22,33,9,40,27
3.   Column Name is Temperature
4.   List the Indexes in the DataFrame
5.   Display the Datatype of the Column in the DataFrame

In [ ]:
# Insert Code Here

In [ ]:
# Program 4
# Displaying the Value Associated of a Specified Index
df.loc['c']

numbers    30
Name: c, dtype: int64

In [ ]:
# Program 5
# Displaying the Values Associated of Specified Indices
df.loc[['a','d']]

   numbers
a       10
d       40

In [ ]:
# Program 6
# Display Contents of Specified Rows
df.iloc[1:3]

   numbers
b       20
c       30

**Exercise 2- Write a Program which:-**


1.   Displays the Value associated with the indexes k and m  in your DataFrame
2.   Displays the Contents of the 3rd and 4th Row of the DataFrame

In [ ]:
# Insert Code Here

In [ ]:
# Program 7
# Calculating and Displaying the Sum of a Row
df.sum()

numbers    100
dtype: int64

In [ ]:
# Program 8
# Method 1
# Calculating and Displaying the Squares of the numbers in the Column
df.apply(lambda x:x**2)

   numbers
a      100
b      400
c      900
d     1600

In [ ]:
# Program 9
# Method 2
# Calculating and Displaying the Squares of the numbers in the Column
df**2

   numbers
a      100
b      400
c      900
d     1600

**Exercise 3 - Write a Program which:-**


1.   Displays the Sum of the Temperature Column in your DataFrame
2.   Displays the Cube of the Numbers in your DataFrame

In [ ]:
#Insert Code Here

In [ ]:
# Program 10
# Adding an extra column called floats to the DataFrame and Also adding the Values
df['floats'] = (1.5,2.5,3.5,4.5)

In [ ]:
# Program 11
# Displaying the contents of the newly added column floats
df['floats']

a    1.5
b    2.5
c    3.5
d    4.5
Name: floats, dtype: float64

**Exercise 4 - Write a Program which:-**


1.   Adds an extra column to your DataFrame called Maximum_Temp and populates it with floats.
2.   Then Display the DataFrame

In [ ]:
# Insert Code Here

In [ ]:

df['names'] = pd.DataFrame(['Yves','Sanda','Lilli','Henry'],index = ['d','a','b','c'])

In [ ]:
df

   numbers  floats  names
a       10     1.5  Sanda
b       20     2.5  Lilli
c       30     3.5  Henry
d       40     4.5   Yves

**Exercise 5 - Add an extra column to your DataFrame called Countries and Populate it with Country Names**

In [ ]:
# Insert Code Here

In [ ]:
df.append({'numbers':100, 'floats':5.75,'names':'Jil'},ignore_index=True)

   numbers  floats  names
0       10    1.50  Sanda
1       20    2.50  Lilli
2       30    3.50  Henry
3       40    4.50   Yves
4      100    5.75    Jil

In [ ]:
df

   numbers  floats  names
a       10     1.5  Sanda
b       20     2.5  Lilli
c       30     3.5  Henry
d       40     4.5   Yves

In [ ]:
df = df.append(pd.DataFrame({'names':'Liz'}, index = ['z']), sort= False)

In [ ]:
df

   numbers  floats  names
a     10.0     1.5  Sanda
b     20.0     2.5  Lilli
c     30.0     3.5  Henry
d     40.0     4.5   Yves
z      NaN     NaN    Liz

In [ ]:
df.dtypes

numbers    float64
floats     float64
names       object
dtype: object

In [ ]:
df[['numbers','floats']].mean()

numbers    25.0
floats      3.0
dtype: float64

In [ ]:
df[['numbers','floats']].std()

numbers    12.909944
floats      1.290994
dtype: float64